import 'package:about_australia/components/card_model.dart';
import 'package:about_australia/theme/app_colors.dart';
import 'package:flutter/material.dart';

List<CardInformationModel> mapsCardsInformation = [
  CardInformationModel(
      title: "دار أوبرا سيدني",
      subTitle: "",
      backButonColor: Colors.black,
      article:
          "هذا المبنى يعد من أهم الرموز لدولة استراليا، ومن غير الممكن زيارة مدينة سيدني من دول زيارة هذا المبنى، الذي يعد من مواقع التراث العالمي لليونسكو، والذي يمتاز بالتصميم المذهل ، والموقع الرائع على سواحل المدينة.",
      assetPath: "assets/images/map/1.jpg"),
  CardInformationModel(
      title: "الحاجز المرجاني العظيم",
      subTitle: "",
      article:
          "عندما تكون في دولة استراليا فلديك الفرصة لزيارة أكبر حاجز مرجاني في العالم، هذا الحاجز يمكن رؤيته من الفضاء الخارجي بفضل مساحته الشاسعة، هنا يمكن مشاهدة أزيد من 3000 من الشعاب المرجانية، بالإضافة إلى أكثر من 600 جزيرة، وعدد هائل من أنواع الأسماك التي تعد من اجمل الاسماك على كوكبنا.",
      assetPath: "assets/images/map/2.jpg"),
  CardInformationModel(
      title: "حديقة أولورو كاتا تجوتا الوطنية",
      subTitle: "",
      article:
          "\"حديقة أولورو كاتا تجوتا الوطنية هي أحد أهم الوجهات السياحية في دولة استراليا ، وهي موطن لصخرة تعرف باسم ايرز روك او أولورو، التي تعد من عجائب الطبيعة الأكثر شهرة في البلاد وأحد مواقع التراث العالمي لليونسكو، وهي صخرة ضخمة ناتجة عن التآكل البطيء لسلسلة من الجبال كانت يوما قائمة في هذا المكان.\"",
      assetPath: "assets/images/map/3.jpg"),
  CardInformationModel(
      title: "حديقة أولورو كاتا تجوتا الوطنية",
      subTitle: "",
      article:
          "جسر ميناء سيدني هو جسر يقع في مدينة سيدني ، يعتبر من أشهر المعالم السياحية في البلاد، وأحد أجمل الجسور في العالم، الجسر تم بناؤه في عام 1932 ، على ارتفاع 134 مترا من ميناء المدينة، ويمتد لمسافة 500 متر، من أهم الأنشطة التي يقوم بها السياح هنا، هو الصعود الى اعلى الجسر واخذ نظرة على مدينة سيدني ومينائها.",
      assetPath: "assets/images/map/4.jpg"),
  CardInformationModel(
      title: "حديقة الجبال الزرقاء الوطنية",
      subTitle: "",
      article:
          "حديقة الجبال الزرقاء الوطنية ، حديقة تعد من مواقع التراث العالمي لليونسكو، وهي حديقة تقع على بعد 81 كم من غرب مدينة سيدني، تغطي هذه الحديقة حوالي 664 ألف فدان من الأراضي البرية، منها مسارات مخصصة للمشي تمتد لمسافة 140 كم، بالإضافة إلى كونها موطنا للعديد من الانهار والشلالات وغيرها .",
      assetPath: "assets/images/map/5.jpg"),
  CardInformationModel(
      title: "ملبورن",
      subTitle: "",
      article:
          "ملبورن هي ثاني أكبر مدينة في استراليا، وواحدة من أكثر المدن زيارة في العالم من السياح، هذه المدينة تضم مجموعة متنوعة من المعالم السياحية ، مثل المسارح والمتاحف والحدائق وغيرها ، ومن أشهر الوجهات في المدينة ، نجد نهر بارا و سوق الملكة فيكتوريا",
      assetPath: "assets/images/map/6.jpg"),
  CardInformationModel(
      title: "شاطئ بوندي",
      subTitle: "",
      article:
          "شاطئ بوندي يعد واحدا من أشهر الشواطئ في العالم ومن أجملها، وهو شاطئ يبعد حوالي دقيقة واحدة بالسيارة عن وسط المدينة، سنويا يقصد هذا المكان مئات الآلاف من السياح، من أجل التنزه أو السباحة أو ممارسة بعض الرياضات المائية، وخاصة ركوب الأمواج. ",
      assetPath: "assets/images/map/7.jpg"),
  CardInformationModel(
      title: "حديقة دينتري الوطنية ",
      subTitle: "",
      article:
          "جزيرة فريزر هي جزيرة مدرجة في قائمة التراث العالمي، تعد أكبر جزيرة رملية في العالم، وواحدة من أكثر الوجهات جذبا للسياح في البلاد، وخاصة لممارسة بعض الرياضات مثل سباقات سيارات الدفع الرباعي، بالاضافة الى عشاق الطبيعية، في الجزيرة تعد موطنا لمجموعة من المعالم الطبيعية، منها الغابات المطيرة الذي يعيش بها أكثر من 300 نوع من الطيور.",
      assetPath: "assets/images/map/8.jpg"),
  CardInformationModel(
      title: "جزيرة فريزر",
      subTitle: "",
      article:
          "جزيرة فريزر هي جزيرة مدرجة في قائمة التراث العالمي، تعد أكبر جزيرة رملية في العالم، وواحدة من أكثر الوجهات جذبا للسياح في البلاد، وخاصة لممارسة بعض الرياضات مثل سباقات سيارات الدفع الرباعي، بالاضافة الى عشاق الطبيعية، في الجزيرة تعد موطنا لمجموعة من المعالم الطبيعية، منها الغابات المطيرة الذي يعيش بها أكثر من 300 نوع من الطيور.",
      assetPath: "assets/images/map/9.jpg"),
  CardInformationModel(
      title: "حديقة كاكادو الوطنية",
      subTitle: "",
      article:
          "حديقة كاكادو الوطنية هي موقع تراث عالمي، تغطي مساحة تقدر بأكثر من 194 ألف كم مربع، كأكبر حديقة وطنية في البلاد ، وثاني أكبر حديقة في العالم، داخل هذه الحديقة يمكن مشاهدة الكثير من الأشياء المثيرة، بما في ذلك الغابات المطيرة والأنهار والوديان والشلالات وغيرها، بالاضافة الى اكثر من 300 نوع مختلف من الطيور، وعدد آخر من الحيوانات مثل تماسيح المياه العذبة والمياه المالحة.",
      assetPath: "assets/images/map/10.jpg"),
];
List<CardInformationModel> travelCardInformationModel = [
  CardInformationModel(
      title: "الحياة البرية في أستراليا",
      subTitle: "عن الطبيعة والحيوانات في أستراليا",
      article:
          "على الرغم من أن معظم أستراليا مناطق شبه قاحلة أو صحراء، إلا أنها تمتلك مجموعة متنوعة من البيئات مثل من بيئة الآلبية إلى الغابات الاستوائية، ولذلك تصنف ضمن البلدان ذات التنوع الحيوي الشديد. وبسبب عمر القارة الكبير، تتنوع الأقاليم مناخية، وعزلة جغرافية طويلة المدى، معظم الكائنات الحية في أسترالية فريدة من نوعها ومتنوعة. حوالي (85%) من الأزهار و(84%) من الثدييات و(45%) من الطيور و(89%) الأسماك التي تعيش في المناخ المعتدل متوطنة بالقارة. ولدى أستراليا عدد كبير من الزواحف، حيث تصل إلى 755 نوع.\nتتألف معظم غابات أستراليا من الأنواع دائماً الخضرة، خصوصاً أشجار الكينا في المناطق الأقل قاحلة وطلح في الصحاري المناطق الجافة كأكثر الأنواع انتشاراً. ومن بين الحيوانات الأسترالية الأكثر شهرة هم أحاديات المسلك (خلد الماء والنضناض); ومجموعة من الجرابيات، مثل الكنغر والكوالا والومبت والطيور مثل إيمو والكوكابورا. وتعدّ أستراليا موطنا للعديد من الحيوانات الخطيرة في ما بينهم أكثر أفاعي سامة في العالم. انقرضت العديد من النباتات منذ الاستيطان الأول البشري للقارة,بما في ذلك كائنات حيوانية ضخمة أسترالية، وأخرون اختفى منذ الاستيطان الأوروبي، مثل ثيلسين.\nهناك العديد من المناطق الإيكولوجية الأسترالية، والعديد من الأنواع مهددة بسب النشاطات الإنسانية.وقانون حماية البيئة الفدرالية وحفظ التنوع الحيوي لعام 1999 هو الإطار القانوني لحماية الأنواع المهددة بالانقراض. وأنشا العديد من المحميات الطبيعية في إطار الإستراتيجية الدولية لحفظ وحماية التنوع البيئي الأسترالية والحفاظ على النظم الايكولوجية الفريدة.\nوصنفت 65 منطقة رطبة ضمن اتفاقية رامسار, وأنشا 16 مواقع للتراث العالمي. وكانت أستراليا تحتل المرتبة رقم 51 ضمن 163 في مؤشر الأداء البيئي 2010.\n",
      assetPath: "assets/images/about_australia/1.jpg"),
];

List<CardInformationModel> aboutAustraliaInformationModel = [
  CardInformationModel(
      title: "الحياة البرية في أستراليا",
      subTitle: "عن الطبيعة والحيوانات في أستراليا",
      article:
          "على الرغم من أن معظم أستراليا مناطق شبه قاحلة أو صحراء، إلا أنها تمتلك مجموعة متنوعة من البيئات مثل من بيئة الآلبية إلى الغابات الاستوائية، ولذلك تصنف ضمن البلدان ذات التنوع الحيوي الشديد. وبسبب عمر القارة الكبير، تتنوع الأقاليم مناخية، وعزلة جغرافية طويلة المدى، معظم الكائنات الحية في أسترالية فريدة من نوعها ومتنوعة. حوالي (85%) من الأزهار و(84%) من الثدييات و(45%) من الطيور و(89%) الأسماك التي تعيش في المناخ المعتدل متوطنة بالقارة. ولدى أستراليا عدد كبير من الزواحف، حيث تصل إلى 755 نوع.\nتتألف معظم غابات أستراليا من الأنواع دائماً الخضرة، خصوصاً أشجار الكينا في المناطق الأقل قاحلة وطلح في الصحاري المناطق الجافة كأكثر الأنواع انتشاراً. ومن بين الحيوانات الأسترالية الأكثر شهرة هم أحاديات المسلك (خلد الماء والنضناض); ومجموعة من الجرابيات، مثل الكنغر والكوالا والومبت والطيور مثل إيمو والكوكابورا. وتعدّ أستراليا موطنا للعديد من الحيوانات الخطيرة في ما بينهم أكثر أفاعي سامة في العالم. انقرضت العديد من النباتات منذ الاستيطان الأول البشري للقارة,بما في ذلك كائنات حيوانية ضخمة أسترالية، وأخرون اختفى منذ الاستيطان الأوروبي، مثل ثيلسين.\nهناك العديد من المناطق الإيكولوجية الأسترالية، والعديد من الأنواع مهددة بسب النشاطات الإنسانية.وقانون حماية البيئة الفدرالية وحفظ التنوع الحيوي لعام 1999 هو الإطار القانوني لحماية الأنواع المهددة بالانقراض. وأنشا العديد من المحميات الطبيعية في إطار الإستراتيجية الدولية لحفظ وحماية التنوع البيئي الأسترالية والحفاظ على النظم الايكولوجية الفريدة.\nوصنفت 65 منطقة رطبة ضمن اتفاقية رامسار, وأنشا 16 مواقع للتراث العالمي. وكانت أستراليا تحتل المرتبة رقم 51 ضمن 163 في مؤشر الأداء البيئي 2010.\n",
      assetPath: "assets/images/about_australia/1.jpg"),
  CardInformationModel(
      title: "الرياضة",
      subTitle: "عن الاهتمام بالرياضة وأهم الرياضات في أستراليا",
      article:
          "يحرص حوالي 24 بالمئة من الأستراليين من هم 15 سنة أو أكبر على الانخراط في أنشطة رياضية منظمة. تعد كرة القدم الأسترالية والكريكت من أكثر الرياضات شعبية في أسترالية. كما أن أستراليا تتميز بالرياضات المائية وخاصة ركوب الأمواج، رياضات الزوارق السريعة والزوارق الشراعية. وتعد أستراليا ثاني أعلى دولة من حيث الفوز بالمدليات في رياضة السباحة بالألعاب الأوليمبية. \nاشتركت أستراليا في في جميع دورات ألعاب أولمبية صيفية في الفترة الحديثة. وفي جميع دورات ألعاب الكومنولث أيضا. واستضافت أستراليا دورتي الألعاب الأوليمبية الصيفية في 1956 بملبرون و2000 بسيدني. كما استضافت أستراليا أربع دورات لألعاب الكومنولث في أعوام 1938 و1962 و1982 و2006. بعض الفاعليات الرياضية الكبيرة التي استضافتها أستراليا تشمل بطولة أستراليا المفتوحة للتنس ومباريات دولية في رياضة الكريكت وجائزة أستراليا الكبرى للفورملا وان.\n",
      assetPath: "assets/images/about_australia/2.jpg"),
  CardInformationModel(
      title: "التعليم",
      subTitle: "الاهتمام بالعلم في أستراليا",
      article:
          "يكون حضور المدارس في أستراليا إلزامي. حيث يتلقى كل الأطفال 11 عاماً إجبارياً من التعليم في ما بين العمر 6 إلى 16، ثم يعطوهم عامين اختياريين إضافيين، وهذا ساهم في محو الأمية بنسبة كبيرة. ويكون هناك سنة تمهيدية قبل العام الأول من الدراسة, وإن لم تكن إلزامياً إلا أنه عادة مايقوموا بها. وفي برنامج الدولي لتقييم الطلاب، عادة ماتكون أستراليا ضمن الأوائل الخمس في من أكثر من ثلاثين دولة كبرى متقدمة. وتصنف المنظمة التعاون وتنمية البلاد أستراليا ضمن أكثر الدول تكلفة لحضور الجامعة. يعدّ (58%) من الأسترالين الذيين يتراوح عمرهم ما بين 25 و64 عام لديهم مؤهلات مهنية ومؤهلات التعليم العالي, ومعدل التخرج الجامعي (48%) وهو يعدّ أكبر مؤهل ضمن منظمة التعاون وتنمية البلاد.\nتنافس الجامعات الأسترالية على مراكز متقدمة في تصنيف الجامعات العالمي حيث حصلت جامعة ملبورن على المرتبة 36 على مستوى العالم حسب تصنيف التايمز للتعليم العالي للتصنيف العالمي للجامعات لعامي 2010-2011 وحصلت جامعة أستراليا الوطنية على المرتبة 43 وجامعة سيدني على المرتبة 71 وجامعة أدليد على المرتبة 73 وجامعة كوينزلاند على المرتبة 81 وجامعة نيو ساوث ويلز على المرتبة 152 وجامعة موناش على المرتبة 178\n",
      assetPath: "assets/images/about_australia/3.jpg"),
  CardInformationModel(
      title: "حقائق مبهرة",
      subTitle: "بطولة العالم لسباق الصراصير؟",
      article:
          "1- إذا زرت شاطئًا واحد من شواطئ استراليا كل يوم, تحتاج 27 سنة لتزورهم جميعًا\n2- في كل سنة تقام في أستراليا المسابقة العالمية لسباق الصراصير\n3- أستراليا هي القارة الوحيدة في العالم بلا أي براكين نشطة\n4- لدى أستراليا من الخراف 3 أضعاف ما لديها من البشر\n5- أكبر عدد من اليونانيين بعد اليونان, متواجد في ميلبورن فيكتوريا\n6- قام أحد الأستراليين مرة بمحاولة بيع نيوزيلندا على موقع e-bay\n7- الجبال الألبية في أستراليا يهطل فيها الثلج أكثر من ما يهبط في نيوزلندا\n8- معظم النباتات المميزة, والحيوانات من الجرابيات \"كالكنغر والكوالا والكوكاس\" لا تتواجد إلا في أستراليا\n9- أستراليا هي ثاني دولة في العالم تعطي النساء حق التصويت في الانتخابات عام 1902\n10- تم اختيار كانبرا لتكون العاصمة لأن ميلبورن وسيدني لم يتوقفوا عن الجدال حول أي منهم يجب أن تكون العاصمة\n\n",
      assetPath: "assets/images/about_australia/4.jpg"),
  CardInformationModel(
      title: "المناخ",
      subTitle: "المناخ في أهم المقاطعات الأسترالية",
      article:
          "مقاطعة العاصمة الأسترالية\n\nبسبب ارتفاعها عن البحر (650 متر (2130 قدم)) والمسافة من الساحل، تتعرض مقاطعة العاصمة الأسترالية لمناخ الأراضي المرتفعة شبه الاستوائي (Cfb). تحظى كانبرا بصيف مطير ولطيف نسبيًا مع أيام حارة متقطعة. تحظى كانبرا بشتاء بارد مع تكرر الصقيع والضباب. تغطي الثلوج العديد من الجبال المرتفعة في الجزء الجنوبي الغربي من المقاطعة خلال فترة من الشتاء. يمكن أن تحدث العواصف الرعدية في الفترة بين أكتوبر ومارس، وتسقط الأمطار بمعدل 623 مللي متر (25 بوصة) سنويًا، مع أقصى معدل للأمطار خلال الربيع والصيف والأقل في الشتاء.\n\nنيو ساوث ويلز\n\nيتعرض أكثر من نصف نيو ساوث ويلز للمناخ القاحل أو شبه القاحل. يتمتع الجزء الشرقي بمناخ معتدل، يتراوح من المناخ شبه الاستوائي الرطب في الحدود الشمالية مرورًا بسنترال كوست ومعظم سيدني، ومناخ محيطي في الساحل الجنوبي. تقع منطقة الجبال الثلجية في الجنوب الشرقي في نطاق المناخ الألبي أو منطقة المناخ المحيطي شبه القطبي، مع طقس منعش إلى بارد طوال العام وسقوط الثلوج في الشتاء. بالدخول في اليابسة، يصبح المناخ شبه قاحل وصحراوي باتجاه الأجزاء الغربية من الولاية.\nكما يكون الطقس في النصف الجنوبي من الولاية دافئًا بشكل عام وحارًا في الصيف ومنعشًا في الشتاء. تعتبر الفصول أكثر وضوحًا في النصف الجنوبي من الولاية، خاصة في المنحدرات الجنوبية الغربية وسنترال ويست ومنطقة ريفيرينا. تأتي ذروة الأمطار في الصيف في معظم أجزاء الولاية، على الرغم أن منطقة ريفيرينا، التي تقع في منتصف الجزء الجنوبي من الولاية وتحد فيكتوريا، تحظى بصيف جاف وتأتي ذروة الأمطار في الشتاء. في أيام الصيف الحارة، يلطف «باستر الجنوبي» الحرارة الشديدة التي تتعرض لها المناطق الساحلية في منطقة نيو ساوث ويلز، من بورت ماكواري باتجاه الجنوب وصولًا إلى ناورا.\nيعتبر الجزء الشمالي الغربي هو الأدفأ، حيث يكون الصيف حارًا للغاية، ويكون الشتاء أبرد وأكثر جفافًا.\n",
      assetPath: "assets/images/about_australia/5.jpg"),
];
