import 'package:about_australia/components/card_model.dart';
import 'package:about_australia/theme/app_colors.dart';
import 'package:flutter/material.dart';

List<CardInformationModel> mapsCardsInformation = [
  CardInformationModel(
      imageUrl:
          "https://ak-d.tripcdn.com/images/10060n000000e4c6nEB47.jpg?proc=source%2Ftrip",
      title: "دار أوبرا سيدني",
      subTitle: "هنا راد",
      article:
          "ثصاشصخث شخصثهتقخ شصثبخشصتثبخ شخصثهبتشخصب خشصهثتبخش ثصبخشصثهتبخشهىصب شصخثهبتخشصثىبشص ثبخشصهبتخشصىبخشبى"),
  CardInformationModel(
      imageUrl:
          "https://ak-d.tripcdn.com/images/10060n000000e4c6nEB47.jpg?proc=source%2Ftrip",
      title: "دار أوبرا سيدني",
      subTitle: "هنا راد",
      article:
          "ثصاشصخث شخصثهتقخ شصثبخشصتثبخ شخصثهبتشخصب خشصهثتبخش ثصبخشصثهتبخشهىصب شصخثهبتخشصثىبشص ثبخشصهبتخشصىبخشبى"),
  CardInformationModel(
      imageUrl:
          "https://ak-d.tripcdn.com/images/10060n000000e4c6nEB47.jpg?proc=source%2Ftrip",
      title: "دار أوبرا سيدني",
      subTitle: "هنا راد",
      article:
          "ثصاشصخث شخصثهتقخ شصثبخشصتثبخ شخصثهبتشخصب خشصهثتبخش ثصبخشصثهتبخشهىصب شصخثهبتخشصثىبشص ثبخشصهبتخشصىبخشبى"),
];
List<CardInformationModel> travelCardInformationModel = [
  CardInformationModel(
      imageUrl:
          "https://ak-d.tripcdn.com/images/10060n000000e4c6nEB47.jpg?proc=source%2Ftrip",
      title: "دار أوبرا سيدني",
      subTitle: "هنا راد",
      article:
          "ثصاشصخث شخصثهتقخ شصثبخشصتثبخ شخصثهبتشخصب خشصهثتبخش ثصبخشصثهتبخشهىصب شصخثهبتخشصثىبشص ثبخشصهبتخشصىبخشبى"),
  CardInformationModel(
      imageUrl:
          "https://ak-d.tripcdn.com/images/10060n000000e4c6nEB47.jpg?proc=source%2Ftrip",
      title: "دار أوبرا سيدني",
      subTitle: "هنا راد",
      article:
          "ثصاشصخث شخصثهتقخ شصثبخشصتثبخ شخصثهبتشخصب خشصهثتبخش ثصبخشصثهتبخشهىصب شصخثهبتخشصثىبشص ثبخشصهبتخشصىبخشبى"),
  CardInformationModel(
      imageUrl:
          "https://ak-d.tripcdn.com/images/10060n000000e4c6nEB47.jpg?proc=source%2Ftrip",
      title: "دار أوبرا سيدني",
      subTitle: "هنا راد",
      article:
          "ثصاشصخث شخصثهتقخ شصثبخشصتثبخ شخصثهبتشخصب خشصهثتبخش ثصبخشصثهتبخشهىصب شصخثهبتخشصثىبشص ثبخشصهبتخشصىبخشبى"),
];

List<CardInformationModel> aboutAustraliaInformationModel = [
  CardInformationModel(
      backButonColor: AppColors.neutrals[800],
      title: "الرياضة في أستراليا",
      imageUrl:
          "https://images.unsplash.com/photo-1532484364607-fc84a124a237?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=634&q=80",
      article:
          "يُعد الثّوم (الاسم العلمي: .Allium sativum L) أحدَ أنواع النباتات العشبيّة أُحاديّة الفلقة التي تنتمي الى جِنس الثّوم، وفصيلة الثّوميات، وهو نباتٌ بصليّ، ينمو في المُناخ المُعتدل، ويصل طوله الى 1.2 متر، وله عدّة أنواع، ويُعدُّ ثاني أكثر نوعٍ انتشاراً من جنس الثوم\nيّات (الاسم العلمي: Alliaceae) في جميع أنحاء العالم،[١][٢] وقد استُخدِم الثوم على مدى قرون لأغراض الطهي، والطب، ويمتاز باحتوائه على مركبات الكبريت العضويّة التي يُعتقد أنّها سبب\n رائحته، ونكهته، كما أنّه له عدة فوائد صحيّة مُحتملة س\nيتم ذكرها في هذا المقال احتلال الأوروبيين للقارة في أواخر القرن ال18، كان يعيش في القارة سكان أستراليا الأصليون  الذين كانوا ينتمون لما يقارب من 250 أسرة لغات. وبعد أن إكتشفها الملاحة الهولنديون في عام 1606، استولت بريطانيا على النصف الشرقي من أستراليا في 1770، وكان أول استحواذ رسمي كامل على أستراليا في 26 يناير 1788، وعندها نما عدد السكان بثبات في العقود اللاحقة، وتم اكتشاف باقي القارة وعن\nدها أضيفت خمسة مستعمرات إضافية للحكم الذاتي لولي عهد بريط",
      subTitle: "شيبش شثصب نصثب "),
  CardInformationModel(
      article:
          "يُعد الثّوم (الاسم العلمي: .Allium sativum L) أحدَ أنواع النباتات العشبيّة أُحاديّة الفلقة التي تنتمي الى جِنس الثّوم، وفصيلة الثّوميات، وهو نباتٌ بصليّ، ينمو في المُناخ المُعتدل، ويصل طوله الى 1.2 متر، وله عدّة أنواع، ويُعدُّ ثاني أكثر نوعٍ انتشاراً من جنس الثوم\nيّات (الاسم العلمي: Alliaceae) في جميع أنحاء العالم،[١][٢] وقد استُخدِم الثوم على مدى قرون لأغراض الطهي، والطب، ويمتاز باحتوائه على مركبات الكبريت العضويّة التي يُعتقد أنّها سبب\n رائحته، ونكهته، كما أنّه له عدة فوائد صحيّة مُحتملة س\nيتم ذكرها في هذا المقال احتلال الأوروبيين للقارة في أواخر القرن ال18، كان يعيش في القارة سكان أستراليا الأصليون  الذين كانوا ينتمون لما يقارب من 250 أسرة لغات. وبعد أن إكتشفها الملاحة الهولنديون في عام 1606، استولت بريطانيا على النصف الشرقي من أستراليا في 1770، وكان أول استحواذ رسمي كامل على أستراليا في 26 يناير 1788، وعندها نما عدد السكان بثبات في العقود اللاحقة، وتم اكتشاف باقي القارة وعن\nدها أضيفت خمسة مستعمرات إضافية للحكم الذاتي لولي عهد بريط",
      subTitle: "شيبش شثصب نصثب ",
      title: "الرياضة في أستراليا",
      imageUrl:
          "https://images.unsplash.com/photo-1494233892892-84542a694e72?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=701&q=80"),
  CardInformationModel(
    article:
        "يُعد الثّوم (الاسم العلمي: .Allium sativum L) أحدَ أنواع النباتات العشبيّة أُحاديّة الفلقة التي تنتمي الى جِنس الثّوم، وفصيلة الثّوميات، وهو نباتٌ بصليّ، ينمو في المُناخ المُعتدل، ويصل طوله الى 1.2 متر، وله عدّة أنواع، ويُعدُّ ثاني أكثر نوعٍ انتشاراً من جنس الثوم\nيّات (الاسم العلمي: Alliaceae) في جميع أنحاء العالم،[١][٢] وقد استُخدِم الثوم على مدى قرون لأغراض الطهي، والطب، ويمتاز باحتوائه على مركبات الكبريت العضويّة التي يُعتقد أنّها سبب\n رائحته، ونكهته، كما أنّه له عدة فوائد صحيّة مُحتملة س\nيتم ذكرها في هذا المقال احتلال الأوروبيين للقارة في أواخر القرن ال18، كان يعيش في القارة سكان أستراليا الأصليون  الذين كانوا ينتمون لما يقارب من 250 أسرة لغات. وبعد أن إكتشفها الملاحة الهولنديون في عام 1606، استولت بريطانيا على النصف الشرقي من أستراليا في 1770، وكان أول استحواذ رسمي كامل على أستراليا في 26 يناير 1788، وعندها نما عدد السكان بثبات في العقود اللاحقة، وتم اكتشاف باقي القارة وعن\nدها أضيفت خمسة مستعمرات إضافية للحكم الذاتي لولي عهد بريط",
    subTitle: "شيبش شثصب نصثب ",
    imageUrl:
        "https://ak-d.tripcdn.com/images/10060n000000e4c6nEB47.jpg?proc=source%2Ftrip",
    title: "دار أوبرا سيدني",
  ),
  CardInformationModel(
      article:
          "يُعد الثّوم (الاسم العلمي: .Allium sativum L) أحدَ أنواع النباتات العشبيّة أُحاديّة الفلقة التي تنتمي الى جِنس الثّوم، وفصيلة الثّوميات، وهو نباتٌ بصليّ، ينمو في المُناخ المُعتدل، ويصل طوله الى 1.2 متر، وله عدّة أنواع، ويُعدُّ ثاني أكثر نوعٍ انتشاراً من جنس الثوم\nيّات (الاسم العلمي: Alliaceae) في جميع أنحاء العالم،[١][٢] وقد استُخدِم الثوم على مدى قرون لأغراض الطهي، والطب، ويمتاز باحتوائه على مركبات الكبريت العضويّة التي يُعتقد أنّها سبب\n رائحته، ونكهته، كما أنّه له عدة فوائد صحيّة مُحتملة س\nيتم ذكرها في هذا المقال احتلال الأوروبيين للقارة في أواخر القرن ال18، كان يعيش في القارة سكان أستراليا الأصليون  الذين كانوا ينتمون لما يقارب من 250 أسرة لغات. وبعد أن إكتشفها الملاحة الهولنديون في عام 1606، استولت بريطانيا على النصف الشرقي من أستراليا في 1770، وكان أول استحواذ رسمي كامل على أستراليا في 26 يناير 1788، وعندها نما عدد السكان بثبات في العقود اللاحقة، وتم اكتشاف باقي القارة وعن\nدها أضيفت خمسة مستعمرات إضافية للحكم الذاتي لولي عهد بريط",
      subTitle: "شيبش شثصب نصثب ",
      title: "الرياضة في أستراليا",
      imageUrl:
          "https://images.unsplash.com/photo-1539734710025-9ebbe24f22f5?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=750&q=80")
];
